/*C++ 継承を使ったバトルゲーム制作
1. 問題
プレイヤーと敵が1対1で戦う、ターン制のバトルゲームを作成してください。
プレイヤーと敵には共通して、以下の能力値があります。
HP
攻撃力
防御力
回避力
これらの共通する能力値は、親クラス（Character）で管理してください。
その親クラスを継承して、
Playerクラス
Enemyクラス
を作成してください。
2. キャラクターの能力値
ゲーム開始時に、プレイヤーと敵の能力値を設定します。
能力値	内容
HP	100
攻撃力	1〜20のランダムな値
防御力	1～20のランダムな値
回避力	1～20のランダムな値
※防御力と回避力は、プレイヤーと敵でそれぞれランダムに決定してください。
3. プレイヤーの行動
プレイヤーのターンになったら、以下のどちらかを選択します。
1：攻撃 2：回復
「1：攻撃」を選択した場合
攻撃時に、1～12のランダムな数字を1つ取得します。
その数字を攻撃力に加えます。
まず、攻撃を受けるキャラクターの回避力と比較します。
攻撃時のランダム値 > 相手の回避力
となった場合、攻撃は成功します。
攻撃が成功した場合、以下の計算式でダメージを求めます。
ダメージ＝ 攻撃力 ＋ 攻撃時のランダム値 － 相手の防御力
求めたダメージを相手のHPから減らしてください。
攻撃に失敗した場合
攻撃時のランダム値が相手の回避力以下だった場合、攻撃は失敗します。
この場合、ダメージは0としてください。
攻撃力 ＋ ランダム値 ≦ 相手の回避力 ↓ 攻撃失敗 ↓ ダメージ 0
4. プレイヤーが「2：回復」を選択した場合
1～12のランダムな数字を取得し、その数値だけプレイヤーのHPを回復してください。
回復量 = 1～12のランダムな値
ただし、HPが100を超えないようにしてください。
5. 敵の行動
プレイヤーのターンが終了したら、敵のターンになります。
敵はランダムに、
1：攻撃 2：回復
のどちらかを選択してください。
敵の攻撃・回復の処理は、プレイヤーと同じルールにしてください。
6. ターンの流れ
ゲームは、以下のように交互に進行します。
【プレイヤーのターン】     ↓ 攻撃 または 回復     ↓ 【敵のターン】     ↓ 攻撃 または 回復     ↓ 【プレイヤーのターン】     ↓ 繰り返し
プレイヤーまたは敵のHPが0以下になった時点でゲームを終了してください。
7. 条件
以下の条件を守ってプログラムを作成してください。
Characterを親クラスとすること
PlayerとEnemyはCharacterを継承するこ
HP、攻撃力、防御力、回避力はCharacterで管理すること
防御力と回避力は1～20のランダム値にすること
攻撃時のランダム値は1～12とすること
プレイヤーは「攻撃」または「回復」を選択すること
敵は「攻撃」または「回復」をランダムに選択すること
HPが0以下になったらゲームを終了すること
プレイヤーと敵が交互に行動すること
数値を直接書き込むマジックナンバーはできるだけ避け、必要な数値は定数として管理すること*/
#include <iostream>
#include <string>
#include <cstdlib>
#include "Character.h"
using namespace std;




class Enemy :public Character
{
public:
	Enemy(string HP, string ATK, string DEF, string EVA)
	{
	
	}
private:

};

int main()
{

}